export const products = [
  {
    "id": "1",
    "name": "โทรศัพท์มือถือ PG Droid V9",
    "price": 1099.0,
    "currency": "THB",
    "short": "โทรศัพท์มือถือ PG Droid V9 เพียงกดไลค์กดแชร์รับสิทธิ์โปรโมชั่นพิเศษ สั่งซื้อผ่านเว็บไซต์เพียง 1099 บาท เท่านั้น",
    "image": "/images/pg1.jpg",
    "features": [
      "จอ 6 นิ้ว (ตัวอย่าง)",
      "รองรับ 4G/สองซิม (ตัวอย่าง)",
      "ประกันร้าน (แก้ไขภายหลัง)"
    ],
    "description": "#คุ้มสุดๆ โทรศัพท์มือถือ PG Droid V9 เพียงกดไลค์👍กดแชร์รับสิทธิ์โปรโมชั่นพิเศษ สั่งซื้อผ่านเว็บไซต์เพียง 1,099 บาท เท่านั้น"
  },
  {
    "id": "2",
    "name": "โทรศัพท์มือถือ PG รุ่น V9 PRO",
    "price": 1590.0,
    "currency": "THB",
    "short": "โทรศัพท์มือถือ PG รุ่น V9 PRO สมาร์ทโฟน 4G หน้าจอกว้าง 6 นิ้ว ใช้ได้ 2 ซิม รองรับ 3G/4G",
    "image": "/images/pg2.jpg",
    "features": [
      "จอ 6 นิ้ว (ตัวอย่าง)",
      "รองรับ 4G/สองซิม (ตัวอย่าง)",
      "ประกันร้าน (แก้ไขภายหลัง)"
    ],
    "description": "โทรศัพท์มือถือ PG รุ่น V9 PRO สมาร์ทโฟน 4G หน้าจอกว้าง 6 นิ้ว ใช้ได้ 2 ซิม รองรับ 3G/4G"
  },
  {
    "id": "3",
    "name": "โทรศัพท์มือถือ PG รุ่น V9+",
    "price": 1590.0,
    "currency": "THB",
    "short": "โทรศัพท์มือถือ PG รุ่น V9 สมาร์ทโฟน 4G หน้าจอกว้าง 6 นิ้ว ใช้ได้ 2 ซิม รองรับ 3G/4G",
    "image": "/images/pg3.jpg",
    "features": [
      "จอ 6 นิ้ว (ตัวอย่าง)",
      "รองรับ 4G/สองซิม (ตัวอย่าง)",
      "ประกันร้าน (แก้ไขภายหลัง)"
    ],
    "description": "โทรศัพท์มือถือ PG รุ่น V9+ สมาร์ทโฟน 4G หน้าจอกว้าง 6 นิ้ว ใช้ได้ 2 ซิม รองรับ 3G/4G"
  },
  {
    "id": "4",
    "name": "โทรศัพท์มือถือ PG รุ่น V9",
    "price": 1590.0,
    "currency": "THB",
    "short": "โทรศัพท์มือถือ PG รุ่น V9 สมาร์ทโฟน 4G หน้าจอกว้าง 6 นิ้ว ใช้ได้ 2 ซิม รองรับ 3G/4G",
    "image": "/images/pg4.jpg",
    "features": [
      "จอ 6 นิ้ว (ตัวอย่าง)",
      "รองรับ 4G/สองซิม (ตัวอย่าง)",
      "ประกันร้าน (แก้ไขภายหลัง)"
    ],
    "description": "โทรศัพท์มือถือ PG รุ่น V9 สมาร์ทโฟน 4G หน้าจอกว้าง 6 นิ้ว ใช้ได้ 2 ซิม รองรับ 3G/4G"
  },
  {
    "id": "5",
    "name": "โทรศัพท์มือถือ PG รุ่น V9 2024",
    "price": 1590.0,
    "currency": "THB",
    "short": "โทรศัพท์มือถือ PG รุ่น V9 2024 สมาร์ทโฟน 4G หน้าจอกว้าง 6 นิ้ว ใช้ได้ 2 ซิม รองรับ 3G/4G",
    "image": "/images/pg5.jpg",
    "features": [
      "จอ 6 นิ้ว (ตัวอย่าง)",
      "รองรับ 4G/สองซิม (ตัวอย่าง)",
      "ประกันร้าน (แก้ไขภายหลัง)"
    ],
    "description": "โทรศัพท์มือถือ PG รุ่น V9 2024 สมาร์ทโฟน 4G หน้าจอกว้าง 6 นิ้ว ใช้ได้ 2 ซิม รองรับ 3G/4G"
  },
  {
    "id": "6",
    "name": "โทรศัพท์มือถือ PG รุ่น V9 2025",
    "price": 1590.0,
    "currency": "THB",
    "short": "โทรศัพท์มือถือ PG รุ่น V9 PRO สมาร์ทโฟน 4G หน้าจอกว้าง 6 นิ้ว ใช้ได้ 2 ซิม รองรับ 3G/4G",
    "image": "/images/pg6.jpg",
    "features": [
      "จอ 6 นิ้ว (ตัวอย่าง)",
      "รองรับ 4G/สองซิม (ตัวอย่าง)",
      "ประกันร้าน (แก้ไขภายหลัง)"
    ],
    "description": "โทรศัพท์มือถือ PG รุ่น V9 PRO สมาร์ทโฟน 4G หน้าจอกว้าง 6 นิ้ว ใช้ได้ 2 ซิม รองรับ 3G/4G"
  },
  {
    "id": "7",
    "name": "โทรศัพท์มือถือ PG รุ่น V9 PRO",
    "price": 1590.0,
    "currency": "THB",
    "short": "โทรศัพท์มือถือ PG รุ่น V9 PRO สมาร์ทโฟน 4G หน้าจอกว้าง 6 นิ้ว ใช้ได้ 2 ซิม รองรับ 3G/4G",
    "image": "/images/pg7.jpg",
    "features": [
      "จอ 6 นิ้ว (ตัวอย่าง)",
      "รองรับ 4G/สองซิม (ตัวอย่าง)",
      "ประกันร้าน (แก้ไขภายหลัง)"
    ],
    "description": "โทรศัพท์มือถือ PG รุ่น V9 PRO สมาร์ทโฟน 4G หน้าจอกว้าง 6 นิ้ว ใช้ได้ 2 ซิม รองรับ 3G/4G"
  },
  {
    "id": "8",
    "name": "โทรศัพท์มือถือ PG รุ่น V9 PRO",
    "price": 1590.0,
    "currency": "THB",
    "short": "โทรศัพท์มือถือ PG รุ่น V9 PRO สมาร์ทโฟน 4G หน้าจอกว้าง 6 นิ้ว ใช้ได้ 2 ซิม รองรับ 3G/4G",
    "image": "/images/pg8.jpg",
    "features": [
      "จอ 6 นิ้ว (ตัวอย่าง)",
      "รองรับ 4G/สองซิม (ตัวอย่าง)",
      "ประกันร้าน (แก้ไขภายหลัง)"
    ],
    "description": "โทรศัพท์มือถือ PG รุ่น V9 PRO สมาร์ทโฟน 4G หน้าจอกว้าง 6 นิ้ว ใช้ได้ 2 ซิม รองรับ 3G/4G"
  },
  {
    "id": "9",
    "name": "โทรศัพท์มือถือ PG รุ่น V9 PRO",
    "price": 1590.0,
    "currency": "THB",
    "short": "โทรศัพท์มือถือ PG รุ่น V9 PRO สมาร์ทโฟน 4G หน้าจอกว้าง 6 นิ้ว ใช้ได้ 2 ซิม รองรับ 3G/4G",
    "image": "/images/pg9.jpg",
    "features": [
      "จอ 6 นิ้ว (ตัวอย่าง)",
      "รองรับ 4G/สองซิม (ตัวอย่าง)",
      "ประกันร้าน (แก้ไขภายหลัง)"
    ],
    "description": "โทรศัพท์มือถือ PG รุ่น V9 PRO สมาร์ทโฟน 4G หน้าจอกว้าง 6 นิ้ว ใช้ได้ 2 ซิม รองรับ 3G/4G"
  },
  {
    "id": "101",
    "name": "โทรศัพท์มือถือ PG รุ่น V9",
    "price": 1590.0,
    "currency": "THB",
    "short": "โทรศัพท์มือถือ PG รุ่น V9 PRO สมาร์ทโฟน 4G หน้าจอกว้าง 6 นิ้ว ใช้ได้ 2 ซิม รองรับ 3G/4G",
    "image": "/images/pg10.jpg",
    "features": [
      "จอ 6 นิ้ว (ตัวอย่าง)",
      "รองรับ 4G/สองซิม (ตัวอย่าง)",
      "ประกันร้าน (แก้ไขภายหลัง)"
    ],
    "description": "โทรศัพท์มือถือ PG รุ่น V9 PRO สมาร์ทโฟน 4G หน้าจอกว้าง 6 นิ้ว ใช้ได้ 2 ซิม รองรับ 3G/4G"
  }
];

export function bySlug(slug){ return products.find(p => p.id === slug); }
